#!/bin/bash
##############################################################
#version 0.2 
#hukang 2018 QQ:2859450898 Email:2859450898@qq.com
#作用:主脚本,用来在分发机m01上运行,一键部署好集群架构.
#使用简介:确保集群中每台主机的IP和主机名都已经规划好，确保每台机器的IP都已经设置好。
##############################################################
export PATH

##############################################################
echo
echo -e "\e[33;40m########################################  \e[0m"
echo -e "\e[33;40m main start \e[0m"
echo -e "\e[33;40m########################################  \e[0m"

#修改m01自己的网卡文件和hostn
#sh ~/basic_setall.sh

sh v2_50_ssh.sh

echo -e "\e[33;40m########################################  \e[0m"
echo -e "\e[33;40m main end \e[0m"
echo -e "\e[33;40m########################################  \e[0m"
echo
